# Name Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementType..::..Name Property
ElementType Class See Also
---
Set the name for the ElementType.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override string Name { set; }
```

Visual Basic
---
```text
Public Overrides WriteOnly Property Name As String
	Set
```

Visual C++
---
```text
public:
virtual property String^ Name {
	void set (String^ value) override;
}
```

# Remarks
This method will assign the element type a new name.
# See Also
ElementType Class
Autodesk.Revit.DB Namespace